LonelyWolf/stm32/stm32l151rdt6-dev/main.c
    // GPS
	printf("GPS enable...\r\n");

	// Reset GPS variables
	USART_FIFO_pos = 0;
	GPS_buf_cntr = 0;
	GPS_new_data = FALSE;
	GPS_parsed = FALSE;
	GPS_sentences_parsed = 0;
	GPS_sentences_unknown = 0;

	// Enable power to the GPS module
	PWR_GPS_ENABLE_H();

	// The GPS USART port initialization
	UARTx_Init(GPS_USART_PORT,USART_TX | USART_RX,9600); // Use slow speed at startup
//	UARTx_InitIRQ(GPS_USART_PORT,USART_IRQ_RXNE,0x0c); // Enable the USART RXNE IRQ with 0x0C priority
//	UARTx_InitIRQ(GPS_USART_PORT,USART_IRQ_RXNE,0xff); // Enable the USART RXNE IRQ with standard priority
	UARTx_InitIRQ(GPS_USART_PORT,USART_IRQ_IDLE,0xff); // Enable the USART IDLE IRQ with standard priority
//	UARTx_InitIRQ(GPS_USART_PORT,USART_IRQ_RXNE | USART_IRQ_IDLE,0xff); // Enable the USART RXNE and IDLE IRQs with standard priority

	// Configure the GPS USART DMA
	RCC->AHBENR |= RCC_AHBENR_DMA1EN; // Enable the DMA1 peripheral clock
	UARTx_ConfigureDMA(GPS_USART_PORT,USART_DMA_RX,USART_DMA_BUF_CIRC,USART_FIFO,USART_FIFO_SIZE); // Configure the USART RX DMA channel
	DMA1_Channel6->CCR |= DMA_CCR6_TCIE | DMA_CCR6_HTIE; // Enable the DMA channel6 HT/TC IRQs
	NVIC_EnableIRQ(DMA1_Channel6_IRQn); // Enable the DMA channel6 IRQ

	// Enable the USART receiver DMA
//	UARTx_SetDMA(GPS_USART_PORT,USART_DMA_RX,ENABLE); // Same as the three following lines, but adds 440 bytes of code
	DMA1->IFCR = DMA_IFCR_CGIF6 | DMA_IFCR_CHTIF6 | DMA_IFCR_CTCIF6 | DMA_IFCR_CTEIF6; // Clear the DMA channel6 IRQ flags
	DMA1_Channel6->CCR |= DMA_CCR1_EN; // Enable the DMA channel6
	GPS_USART_PORT->CR3 |= USART_CR3_DMAR; // Enable the USART receiver DMA

	// Initialize GPS module
//	GPS_Init();




	printf("---------------------------------------------\r\n");
	BEEPER_Enable(2500,1);




/*
	while (1) {
		// Get charger STAT pin state
		i = 0;
		CHRG_STAT_PORT->PUPDR &= ~GPIO_PUPDR_PUPDR2; // Floating (clear bits)
		printf("FL=%u ",(unsigned int)((CHRG_STAT_PORT->IDR & CHRG_STAT_PIN) ? 1 : 0));
		if (CHRG_STAT_PORT->IDR & CHRG_STAT_PIN) i++;

		CHRG_STAT_PORT->PUPDR &= ~GPIO_PUPDR_PUPDR2; // Floating (clear bits)
		CHRG_STAT_PORT->PUPDR |=  GPIO_PUPDR_PUPDR2_0; // Pull-up
		printf("PU=%u ",(unsigned int)((CHRG_STAT_PORT->IDR & CHRG_STAT_PIN) ? 1 : 0));

		CHRG_STAT_PORT->PUPDR &= ~GPIO_PUPDR_PUPDR2; // Floating (clear bits)
		CHRG_STAT_PORT->PUPDR |=  GPIO_PUPDR_PUPDR2_1; // Pull-down
		printf("PD=%u\r\n",(unsigned int)((CHRG_STAT_PORT->IDR & CHRG_STAT_PIN) ? 1 : 0));

		CHRG_STAT_PORT->PUPDR &= ~GPIO_PUPDR_PUPDR2; // Floating (clear bits)

		Delay_ms(5000);
	}
*/




/*
    // Configure the RTC alarm A at 30th second on every minute
	_time.RTC_Hours   = 00;
	_time.RTC_Minutes = 00;
	_time.RTC_Seconds = 30;

	RTC_AlarmCmd(RTC_ALARM_A,DISABLE); // Disable the alarm A
	RTC_SetAlarm(RTC_ALARM_A,&_time,0,RTC_ALARM_MASK_DAY | RTC_ALARM_MASK_HRS | RTC_ALARM_MASK_MIN);
	RTC_ITConfig(RTC_IT_ALRA,ENABLE); // Enable the alarm A interrupt
	RTC_AlarmCmd(RTC_ALARM_A,ENABLE); // Enable the alarm A

	// Configure the RTC alarm A at 10th minute of every hour
	_time.RTC_Hours   = 00;
	_time.RTC_Minutes = 10;
	_time.RTC_Seconds = 00;

	RTC_AlarmCmd(RTC_ALARM_A,DISABLE); // Disable the alarm A
	RTC_SetAlarm(RTC_ALARM_A,&_time,0,RTC_ALARM_MASK_DAY | RTC_ALARM_MASK_HRS | RTC_ALARM_MASK_SEC);
	RTC_ITConfig(RTC_IT_ALRA,ENABLE); // Enable the alarm A interrupt
	RTC_AlarmCmd(RTC_ALARM_A,ENABLE); // Enable the alarm A

	// Configure the RTC alarm A at 3:30:33 every day
	_time.RTC_Hours   = 03;
	_time.RTC_Minutes = 30;
	_time.RTC_Seconds = 33;

	RTC_AlarmCmd(RTC_ALARM_A,DISABLE); // Disable the alarm A
	RTC_SetAlarm(RTC_ALARM_A,&_time,0,RTC_ALARM_MASK_DAY);
	RTC_ITConfig(RTC_IT_ALRA,ENABLE); // Enable the alarm A interrupt
	RTC_AlarmCmd(RTC_ALARM_A,ENABLE); // Enable the alarm A
*/




	// Measure LCD performance
	RCC->AHBENR |= RCC_AHBENR_DMA1EN; // Enable the DMA1 peripheral clock

///*
	// This for nRF24 packet handling
	uint8_t CRC_local;
	uint16_t wake_diff;

	// GFX Demo (rotozoomer with checkerboard or XOR texture)
	float ca,sa;
	float scalee = 0.5;
	float dscalee = 0.05;
	float angle = 0.0;
	float x,y;
	float xrow = 0.0;
	float yrow = 0.0;

    RTC_SetWakeUp(10);
    _new_time = FALSE;
    ST7541_Fill(0x0000);
    d0 = 0;
	while(1) {
		ca = scalee * cosf(angle);
		sa = scalee * sinf(angle);
		xrow = sa;
		yrow = ca;
		for (j = 48; j < 127; j++) {
			x = xrow;
			y = yrow;
			for (i = 1; i < 127; i++) {
				x += ca;
				y += sa;
//				Pixel(i,j,((((int8_t)x >> 3) & 1) ^ (((int8_t)y >> 3) & 1)) ? gs_black : gs_white); // Black and white checker board
				Pixel(i,j,(((int8_t)x >> 3) & 3) ^ (((int8_t)y >> 3) & 3)); // 2-bit XOR texture
			}
			xrow += -sa;
			yrow +=  ca;
		}
		angle += 0.05;
		scalee += ((scalee <= 0.10) || (scalee >= 1.3)) ? dscalee *= -1: dscalee;

		Rect(0,47,127,127,gs_black);
		FillRect(0,0,127,46,gs_white);

		// Draw FPS with shadow effect
		lcd_color = gs_ltgray;
		i = PutIntF(4,4,d0,1,fnt7x10) + 4;
		PutStr(i,4,"FPS",fnt7x10);
		lcd_color = gs_dkgray;
		i = PutIntF(3,3,d0,1,fnt7x10) + 4;
		PutStr(i,3,"FPS",fnt7x10);
		lcd_color = gs_black;
		i = PutIntF(2,2,d0,1,fnt7x10) + 4;
		PutStr(i,2,"FPS",fnt7x10);

		// Draw packets count
		i = 64;
		i += PutStr(i,2,"Pkts:",fnt5x7);
		PutIntU(i,2,_packets_rcvd,fnt5x7);
		i = 64;
		i += PutStr(i,10,"Lost:",fnt5x7);
		PutIntU(i,10,_packets_lost,fnt5x7);

		// Draw time
		RTC_GetDateTime(&_time,&_date);
		i = 0;
		i += PutIntLZ(i,22,_time.RTC_Hours,2,fnt5x7);
		i += DrawChar(i,22,':',fnt5x7);
		i += PutIntLZ(i,22,_time.RTC_Minutes,2,fnt5x7);
		i += DrawChar(i,22,':',fnt5x7);
		i += PutIntLZ(i,22,_time.RTC_Seconds,2,fnt5x7);
		i += 3;
		i += PutIntLZ(i,22,_date.RTC_Date,2,fnt5x7);
		i += DrawChar(i,22,'.',fnt5x7);
		i += PutIntLZ(i,22,_date.RTC_Month,2,fnt5x7);
		i += DrawChar(i,22,'.',fnt5x7);
		i += PutIntLZ(i,22,_date.RTC_Year,2,fnt5x7);
		PutStr(i + 3,22,RTC_DOW_STR[_date.RTC_WeekDay - 1],fnt5x7);

		// GPS info
		i = 0;
		i += PutStr(i,30,"NMEA:",fnt5x7) - 1;
		i += PutIntU(i,30,GPS_sentences_parsed,fnt5x7) - 1;
		i += DrawChar(i,30,'/',fnt5x7) - 1;
		i += PutIntU(i,30,GPS_sentences_unknown,fnt5x7) + 5;
		i += PutStr(i,30,"Fix:",fnt5x7) - 1;
		i += PutIntU(i,30,GPSData.fix,fnt5x7) + 5;
		i += DrawChar(i,30,GPSData.mode,fnt5x7);
		i = 0;
		i += PutStr(i,38,"Sat:",fnt5x7) - 1;
		i += PutIntU(i,38,GPSData.sats_used,fnt5x7) - 1;
		i += DrawChar(i,38,'/',fnt5x7) - 1;
		i += PutIntU(i,38,GPSData.sats_view,fnt5x7) - 1;


		ST7541_Flush_DMA();
		k++;

		if (GPS_new_data) {
			// New GPS packets received
			ParseGPS();
		}

		if (GPS_parsed) {
			// GPS data parsed
			printf("GPS parsed: PCKT=%s DT=%s FIX=%u %u DATE=%u %u\r\n--------\r\n",
					GPSData.valid ? "VALID" : "INVALID",
					GPSData.datetime_valid ? "VALID" : "INVALID",
					GPSData.fix_time,
					GPSData.fix_date,
					GPSData.time,
					GPSData.date
			);
			if (GPSData.datetime_valid) {
				// Date and time obtained from GPS
				_time.RTC_Hours   =  GPSData.time / 3600;
				_time.RTC_Minutes = (GPSData.time / 60) % 60;
				_time.RTC_Seconds =  GPSData.time % 60;
				i = GPSData.date / 1000000;
				_date.RTC_Date  = i;
				_date.RTC_Month = (GPSData.date - (i * 1000000)) / 10000;
				_date.RTC_Year  = (GPSData.date % 10000) - 2000;
//				RTC_AdjustTimeZone(&_time,&_date,3); // 3 --> +3 GMT offset
				RTC_SetDateTime(&_time,&_date);
			}
			GPS_parsed = FALSE;
		}

		if (_new_time) {
			d0 = k;
			_new_time = FALSE;
			k = 0;
		}

